{
  "format": "layers-model",
  "generatedBy": "keras v3.4.1",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.4.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "functional_24",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_66"
            },
            "name": "input_layer_66",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_67"
            },
            "name": "input_layer_67",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_62",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "input_dim": 111,
              "output_dim": 8,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false
            },
            "name": "embedding_62",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 1],
                      "dtype": "float32",
                      "keras_history": ["input_layer_66", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_63",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "input_dim": 6,
              "output_dim": 8,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false
            },
            "name": "embedding_63",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 1],
                      "dtype": "float32",
                      "keras_history": ["input_layer_67", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_60",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 12,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "OrthogonalInitializer",
                "config": { "gain": 1.0, "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "name": "lstm_60",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 1, 8],
                      "dtype": "float32",
                      "keras_history": ["embedding_62", 0, 0]
                    }
                  }
                ],
                "kwargs": { "training": false, "mask": null }
              }
            ]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_61",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "zero_output_for_mask": false,
              "units": 12,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "OrthogonalInitializer",
                "config": { "gain": 1.0, "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "seed": null
            },
            "name": "lstm_61",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 1, 8],
                      "dtype": "float32",
                      "keras_history": ["embedding_63", 0, 0]
                    }
                  }
                ],
                "kwargs": { "training": false, "mask": null }
              }
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_62",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "data_format": "channels_last"
            },
            "name": "flatten_62",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 12],
                      "dtype": "float32",
                      "keras_history": ["lstm_60", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_63",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "data_format": "channels_last"
            },
            "name": "flatten_63",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 12],
                      "dtype": "float32",
                      "keras_history": ["lstm_61", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_58",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 10,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_58",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 12],
                      "dtype": "float32",
                      "keras_history": ["flatten_62", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_59",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "units": 10,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_59",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [null, 12],
                      "dtype": "float32",
                      "keras_history": ["flatten_63", 0, 0]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dot",
            "config": {
              "name": "dot_29",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": { "name": "float32" },
                "registered_name": null
              },
              "axes": 1,
              "normalize": false
            },
            "name": "dot_29",
            "inbound_nodes": [
              {
                "args": [
                  [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 10],
                        "dtype": "float32",
                        "keras_history": ["dense_58", 0, 0]
                      }
                    },
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 10],
                        "dtype": "float32",
                        "keras_history": ["dense_59", 0, 0]
                      }
                    }
                  ]
                ],
                "kwargs": {}
              }
            ]
          }
        ],
        "input_layers": [
          ["input_layer_66", 0, 0],
          ["input_layer_67", 0, 0]
        ],
        "output_layers": [["dot_29", 0, 0]]
      }
    },
    "training_config": {
      "loss": "mse",
      "loss_weights": null,
      "metrics": null,
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_58/kernel", "shape": [12, 10], "dtype": "float32" },
        { "name": "dense_58/bias", "shape": [10], "dtype": "float32" },
        { "name": "dense_59/kernel", "shape": [12, 10], "dtype": "float32" },
        { "name": "dense_59/bias", "shape": [10], "dtype": "float32" },
        {
          "name": "embedding_62/embeddings",
          "shape": [111, 8],
          "dtype": "float32"
        },
        {
          "name": "embedding_63/embeddings",
          "shape": [6, 8],
          "dtype": "float32"
        },
        {
          "name": "lstm_60/lstm_cell/kernel",
          "shape": [8, 48],
          "dtype": "float32"
        },
        {
          "name": "lstm_60/lstm_cell/recurrent_kernel",
          "shape": [12, 48],
          "dtype": "float32"
        },
        { "name": "lstm_60/lstm_cell/bias", "shape": [48], "dtype": "float32" },
        {
          "name": "lstm_61/lstm_cell/kernel",
          "shape": [8, 48],
          "dtype": "float32"
        },
        {
          "name": "lstm_61/lstm_cell/recurrent_kernel",
          "shape": [12, 48],
          "dtype": "float32"
        },
        { "name": "lstm_61/lstm_cell/bias", "shape": [48], "dtype": "float32" }
      ]
    }
  ]
}
